ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/ICSSM_ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_48032000h.xml
<module name="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RXCFG0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RXCFG0" offset="0" width="32" description="MIIRXCFG0Register.">
		<bitfield id="RX_EOF_SCLR_DIS0" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/>
	<bitfield id="RX_ERR_RAW0" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/>
	<bitfield id="RX_SFD_RAW0" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R/W"/>
	<bitfield id="RX_AUTO_FWD_PRE0" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/>
	<bitfield id="RX_BYTE_SWAP0" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/>
	<bitfield id="RX_L2_EN0" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	<bitfield id="RX_MUX_SEL0" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/>
	<bitfield id="RX_CUT_PREAMBLE0" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="RX_DATA_RDY_MODE_DIS0" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/>
	<bitfield id="RX_ENABLE0" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RXCFG1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RXCFG1" offset="4" width="32" description="MIIRXCFG1Register.">
		<bitfield id="RX_EOF_SCLR_DIS1" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/>
	<bitfield id="RX_ERR_RAW1" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/>
	<bitfield id="RX_SFD_RAW1" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R/W"/>
	<bitfield id="RX_AUTO_FWD_PRE1" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/>
	<bitfield id="RX_BYTE_SWAP1" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/>
	<bitfield id="RX_L2_EN1" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	<bitfield id="RX_MUX_SEL1" width="1" begin="3" end="3" resetval="0x1" description="" range="3" rwaccess="R/W"/>
	<bitfield id="RX_CUT_PREAMBLE1" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="RX_DATA_RDY_MODE_DIS1" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/>
	<bitfield id="RX_ENABLE1" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TXCFG0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TXCFG0" offset="16" width="32" description="MIITXCFG0Register.">
		<bitfield id="TX_CLK_DELAY0" width="3" begin="30" end="28" resetval="0x0" description="" range="30:28" rwaccess="R/W"/>
	<bitfield id="TX_START_DELAY0" width="10" begin="25" end="16" resetval="0x64" description="" range="25:16" rwaccess="R/W"/>
	<bitfield id="TX_IPG_WIRE_CLK_EN0" width="1" begin="12" end="12" resetval="0x0" description="" range="12" rwaccess="R/W"/>
	<bitfield id="TX_32_MODE_EN0" width="1" begin="11" end="11" resetval="0x0" description="" range="11" rwaccess="R/W"/>
	<bitfield id="PRE_TX_AUTO_ESC_ERR0" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/>
	<bitfield id="PRE_TX_AUTO_SEQUENCE0" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/>
	<bitfield id="TX_MUX_SEL0" width="1" begin="8" end="8" resetval="0x1" description="" range="8" rwaccess="R/W"/>
	<bitfield id="TX_BYTE_SWAP0" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/>
	<bitfield id="TX_EN_MODE0" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="TX_AUTO_PREAMBLE0" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/>
	<bitfield id="TX_ENABLE0" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TXCFG1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TXCFG1" offset="20" width="32" description="MIITXCFG1Register.">
		<bitfield id="TX_CLK_DELAY1" width="3" begin="30" end="28" resetval="0x0" description="" range="30:28" rwaccess="R/W"/>
	<bitfield id="TX_START_DELAY1" width="10" begin="25" end="16" resetval="0x64" description="" range="25:16" rwaccess="R/W"/>
	<bitfield id="TX_IPG_WIRE_CLK_EN1" width="1" begin="12" end="12" resetval="0x0" description="" range="12" rwaccess="R/W"/>
	<bitfield id="TX_32_MODE_EN1" width="1" begin="11" end="11" resetval="0x0" description="" range="11" rwaccess="R/W"/>
	<bitfield id="PRE_TX_AUTO_ESC_ERR1" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/>
	<bitfield id="PRE_TX_AUTO_SEQUENCE1" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/>
	<bitfield id="TX_MUX_SEL1" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/>
	<bitfield id="TX_BYTE_SWAP1" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/>
	<bitfield id="TX_EN_MODE1" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/>
	<bitfield id="TX_AUTO_PREAMBLE1" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/>
	<bitfield id="TX_ENABLE1" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_CRC0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_CRC0" offset="32" width="32" description="MIITXCRC0Register.">
		<bitfield id="TX_CRC0" width="32" begin="31" end="0" resetval="0x0" description="Transmit CRC for last packet" range="31:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_CRC1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_CRC1" offset="36" width="32" description="MIITXCRC1Register.">
		<bitfield id="TX_CRC1" width="32" begin="31" end="0" resetval="0x0" description="Transmit CRC for last packet" range="31:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_IPG0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_IPG0" offset="48" width="32" description="MIITXIPG0Register.">
		<bitfield id="TX_IPG0" width="16" begin="15" end="0" resetval="0x40" description="Transmit IPG" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_IPG1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_IPG1" offset="52" width="32" description="MIITXIPG1Register.">
		<bitfield id="TX_IPG1" width="16" begin="15" end="0" resetval="0x40" description="Transmit IPG" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_PRS0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_PRS0" offset="56" width="32" description="MIIPortStatus0Register.">
		<bitfield id="SYNC_PORT0_CRS" width="1" begin="1" end="1" resetval="0x0" description="Sync_port0_crs" range="1" rwaccess="R"/>
	<bitfield id="SYNC_PORT0_COL" width="1" begin="0" end="0" resetval="0x0" description="Sync_port0_col" range="0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_PRS1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_PRS1" offset="60" width="32" description="MIIPortStatus1Register.">
		<bitfield id="SYNC_PORT1_CRS" width="1" begin="1" end="1" resetval="0x0" description="Sync_port1_crs" range="1" rwaccess="R"/>
	<bitfield id="SYNC_PORT1_COL" width="1" begin="0" end="0" resetval="0x0" description="Sync_port1_col" range="0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_FRMS0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_FRMS0" offset="64" width="32" description="MIIRXFRMS0Register.">
		<bitfield id="RX_MAX_FRM0" width="16" begin="31" end="16" resetval="0x1521" description="Rx_max_frm0" range="31:16" rwaccess="R/W"/>
	<bitfield id="RX_MIN_FRM0" width="16" begin="15" end="0" resetval="0x63" description="Rx_min_frm0" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_FRMS1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_FRMS1" offset="68" width="32" description="MIIRXFRMS1Register.">
		<bitfield id="RX_MAX_FRM1" width="16" begin="31" end="16" resetval="0x1521" description="Rx_max_frm1" range="31:16" rwaccess="R/W"/>
	<bitfield id="RX_MIN_FRM1" width="16" begin="15" end="0" resetval="0x63" description="Rx_min_frm1" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_PCNT0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_PCNT0" offset="72" width="32" description="MIIRXPCNT0Register.">
		<bitfield id="RX_MAX_PCNT0" width="5" begin="8" end="4" resetval="0x14" description="Rx_max_pcnt0" range="8:4" rwaccess="R/W"/>
	<bitfield id="RX_MIN_PCNT0" width="4" begin="3" end="0" resetval="0x1" description="Rx_min_pcnt0" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_PCNT1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_PCNT1" offset="76" width="32" description="MIIRXPCNT1Register.">
		<bitfield id="RX_MAX_PCNT1" width="5" begin="8" end="4" resetval="0x14" description="Rx_max_pcnt1" range="8:4" rwaccess="R/W"/>
	<bitfield id="RX_MIN_PCNT1" width="4" begin="3" end="0" resetval="0x1" description="Rx_min_pcnt1" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_ERR0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_ERR0" offset="80" width="32" description="MIIRXERR0Register.">
		<bitfield id="RX_MAX_FRM_ERR0" width="1" begin="3" end="3" resetval="0x0" description="Rx_max_frm_err0" range="3" rwaccess="R/W1C"/>
	<bitfield id="RX_MIN_FRM_ERR0" width="1" begin="2" end="2" resetval="0x0" description="Rx_min_frm_err0" range="2" rwaccess="R/W1C"/>
	<bitfield id="RX_MAX_PCNT_ERR0" width="1" begin="1" end="1" resetval="0x0" description="Rx_max_pcnt_err0" range="1" rwaccess="R/W1C"/>
	<bitfield id="RX_MIN_PCNT_ERR0" width="1" begin="0" end="0" resetval="0x0" description="Rx_min_pcnt_err0" range="0" rwaccess="R/W1C"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_ERR1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_ERR1" offset="84" width="32" description="MIIRXERR1Register.">
		<bitfield id="RX_MAX_FRM_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Rx_max_frm_err1" range="3" rwaccess="R/W1C"/>
	<bitfield id="RX_MIN_FRM_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Rx_min_frm_err1" range="2" rwaccess="R/W1C"/>
	<bitfield id="RX_MAX_PCNT_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Rx_max_pcnt_err1" range="1" rwaccess="R/W1C"/>
	<bitfield id="RX_MIN_PCNT_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Rx_min_pcnt_err1" range="0" rwaccess="R/W1C"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_FIFO_LEVEL0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_FIFO_LEVEL0" offset="96" width="32" description="MIIRXFIFOLEVEL0Register.">
		<bitfield id="RX_FIFO_LEVEL0" width="8" begin="7" end="0" resetval="0x0" description="Rx_fifo_level0" range="7:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_FIFO_LEVEL1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_RX_FIFO_LEVEL1" offset="100" width="32" description="MIIRXFIFOLEVEL1Register.">
		<bitfield id="RX_FIFO_LEVEL1" width="8" begin="7" end="0" resetval="0x0" description="Rx_fifo_level1" range="7:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_FIFO_LEVEL0" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_FIFO_LEVEL0" offset="104" width="32" description="MIIRXFIFOLEVEL0Register.">
		<bitfield id="TX_FIFO_LEVEL0" width="8" begin="7" end="0" resetval="0x0" description="tx_fifo_level0" range="7:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_FIFO_LEVEL1" acronym="ICSSM_PR1_MII_RT_PR1_MII_RT_CFG_TX_FIFO_LEVEL1" offset="108" width="32" description="MIIRXFIFOLEVEL1Register.">
		<bitfield id="TX_FIFO_LEVEL1" width="8" begin="7" end="0" resetval="0x0" description="tx_fifo_level1" range="7:0" rwaccess="R"/>
	</register>
</module>